Repository: SteveShi/MacSSH
Catalog: Sources/App/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Connected to %@
zh_hans: 已连接到 %@

source: Enable Notifications
zh_hans: 启用通知

source: Exited with code %@
zh_hans: 退出码 %@

source: Failed to connect to %@
zh_hans: 无法连接到 %@

source: Multiple files
zh_hans: 多个文件

source: Notifications
zh_hans: 通知

source: Only when app is in the background
zh_hans: 仅当应用在后台时

source: Process Exited
zh_hans: 进程已退出

source: Receive system notifications for connection, transfer, and terminal events.
zh_hans: 为连接、传输和终端事件接收系统通知。

source: SFTP transfer events
zh_hans: SFTP 传输事件

source: SSH Connected
zh_hans: 已连接

source: SSH Connection Failed
zh_hans: 连接失败

source: SSH connection events
zh_hans: SSH 连接事件

source: Terminal app notifications & process exit
zh_hans: 终端应用通知与进程退出

source: Terminal Bell
zh_hans: 终端响铃

source: Transfer Complete
zh_hans: 传输完成

source: Transfer Failed
zh_hans: 传输失败

source: [disconnected]
zh_hans: [已断开]

source: [error]
zh_hans: [错误]

source: [send error]
zh_hans: [发送错误]

# %@ (%lld cores)
source: %1$@ (%2$lld cores)
zh_hans: %1$@ (%2$lld 核)

# %@/s
source: %1$@/s
zh_hans: %1$@/秒

source: A modern SSH client for macOS.
zh_hans: 适用于 macOS 的现代 SSH 客户端。

source: About
zh_hans: 关于

source: Add Connection
zh_hans: 添加连接

source: App Behavior
zh_hans: 应用行为

source: Appearance
zh_hans: 外观

source: Application behavior and general preferences.
zh_hans: 应用程序行为和通用偏好。

source: Are you sure you want to delete the selected connection?
zh_hans: 确定要删除选中的连接吗？

source: Authentication
zh_hans: 身份验证

source: Authentication Mode
zh_hans: 身份验证模式

source: Automatically reconnect on failure
zh_hans: 连接失败时自动重连

source: Automatically switch to the selected input method when the app is activated.
zh_hans: 应用激活时自动切换到选定的输入法。

source: Backup & Restore
zh_hans: 备份与恢复

source: Browse
zh_hans: 浏览

source: Cancel
zh_hans: 取消

source: Check for Updates...
zh_hans: 检查更新...

source: Choose
zh_hans: 选择

source: Choose how to import connections. 'Merge' will add new connections from the file, while 'Replace All' will remove all existing data first.
zh_hans: 选择如何导入连接。“合并”将自动追加文件中的新配置，“全部替换”会首先清空当前的全部数据。

source: Click here to type
zh_hans: 点击此处输入

source: Close Session Tab
zh_hans: 关闭会话标签页

source: Close Tab
zh_hans: 关闭标签页

source: Configure Authentication
zh_hans: 配置身份验证

source: Configure SFTP file transfer preferences.
zh_hans: 配置SFTP文件传输首选项。

source: Confirm before disconnecting
zh_hans: 断开连接前确认

source: Connect
zh_hans: 连接

source: Connect to start a session.
zh_hans: 连接以开始会话。

source: Connected
zh_hans: 已连接

source: Connecting...
zh_hans: 正在连接...

source: Connection History
zh_hans: 连接历史

source: Connection is not open.
zh_hans: 连接未建立。

source: Connection Settings
zh_hans: 连接设置

source: Connections
zh_hans: 连接

source: Create a new SSH connection profile
zh_hans: 创建新的 SSH 连接配置

source: Credentials
zh_hans: 凭据

source: Data
zh_hans: 数据

source: Default Input Method
zh_hans: 默认输入法

source: Delete
zh_hans: 删除

source: Delete Connection
zh_hans: 删除连接

source: Disconnect
zh_hans: 断开连接

source: Do Not Switch
zh_hans: 不切换

source: Download
zh_hans: 下载

source: Edit
zh_hans: 编辑

source: Edit Connection Profile
zh_hans: 编辑连接配置

source: Enable Terminal Text Glow
zh_hans: 启用终端文本发光效果

source: Enable these effects for a more modern, state-of-the-art macOS experience.
zh_hans: 启用这些特效，享受更现代、更前沿的 macOS 体验。

source: Enable Vibrancy (Glass Effect)
zh_hans: 启用“生动感”（玻璃效果）

source: Engine
zh_hans: 引擎

source: Error: %@
zh_hans: 错误: %@

source: Establish Connection
zh_hans: 建立连接

source: Export Connections
zh_hans: 导出连接

source: Export Connections...
zh_hans: 导出连接...

source: Failed
zh_hans: 失败

source: Font Family
zh_hans: 字体家族

source: Font Size
zh_hans: 字体大小

source: General
zh_hans: 通用

source: General Information
zh_hans: 一般信息

source: Home
zh_hans: 主目录

source: Host Key Changed
zh_hans: 主机密钥已更改

source: Hostname or IP
zh_hans: 主机名或 IP 地址

source: How this connection appears in your sidebar.
zh_hans: 此连接在侧边栏中的显示名称。

source: Idle
zh_hans: 空闲

source: Import Connections
zh_hans: 导入连接

source: Import Connections...
zh_hans: 导入连接...

source: Input Method
zh_hans: 输入法

source: Labels
zh_hans: 标签

source: LIVE
zh_hans: 实时

source: Load
zh_hans: 负载

source: Local
zh_hans: 本地

source: Local Shell
zh_hans: 本地 Shell

source: Local Terminal
zh_hans: 本地终端

source: MacSSH ready.
zh_hans: MacSSH 已就绪。

source: Manage
zh_hans: 管理

source: Manage Connections
zh_hans: 管理连接

source: Manage your connection data. You can back up all your SSH server configurations to a JSON file and restore them later.
zh_hans: 管理您的连接数据。您可以将所有 SSH 服务器配置备份到 JSON 文件，并在以后恢复它们。

source: Merge (Recommended)
zh_hans: 合并（推荐）

source: Monitor
zh_hans: 监控

source: Name
zh_hans: 名称

source: Native Ghostty (Metal)
zh_hans: 原生Ghostty（Metal）

source: Native Ghostty Engine
zh_hans: 原生Ghostty引擎

source: New Tab
zh_hans: 新标签页

source: Next Tab
zh_hans: 下一个标签页

source: No connection history.
zh_hans: 暂无连接历史。

source: OK
zh_hans: 确定

source: Open Application Settings
zh_hans: 打开应用设置

source: Open Connection
zh_hans: 建立连接

source: Open in Tab
zh_hans: 在标签页中打开

source: OS
zh_hans: 操作系统

source: Overwrite existing files
zh_hans: 覆盖现有文件

source: Password
zh_hans: 密码

source: Password Authentication
zh_hans: 密码身份验证

source: Port
zh_hans: 端口

source: Premium Effects
zh_hans: 高级效果

source: Previous Tab
zh_hans: 上一个标签页

source: Processes
zh_hans: 进程数

source: Public Key Details
zh_hans: 公钥详情

source: Real-time Monitor
zh_hans: 实时监控

source: Recent Connections
zh_hans: 最近连接

source: Reconnect
zh_hans: 重新连接

source: Reconnect Failed
zh_hans: 重新连接失败

source: Refresh Specs
zh_hans: 刷新规格

source: Remember in keychain
zh_hans: 在钥匙串中记住

source: Rename
zh_hans: 重命名

source: Rename Tab
zh_hans: 重命名标签页

source: Rename Terminal Tab
zh_hans: 重命名终端标签页

source: Rendering
zh_hans: 渲染

source: Save
zh_hans: 保存

source: Search connections
zh_hans: 搜索连接

source: Select a server from the sidebar to begin your session, or add a new one to get started.
zh_hans: 从侧边栏选择一个服务器开始会话，或者添加一个新服务器。

source: Select key...
zh_hans: 选择key…

source: Select Private Key
zh_hans: 选择私钥

source: Select your private key file (e.g., id_rsa) for key-based authentication.
zh_hans: 选择您的私钥文件（例如 id_rsa）进行基于密钥的身份验证。

source: Server Address
zh_hans: 服务器地址

source: Server Specs
zh_hans: 服务器规格

source: Session
zh_hans: 会话

source: Settings
zh_hans: 设置

source: Shortcut: ⌘N New Connection
zh_hans: 快捷键：⌘N 新连接

source: Show hidden files
zh_hans: 显示隐藏文件

source: Show SFTP Inspector
zh_hans: 显示 SFTP 面板

source: Show Subtle Grid
zh_hans: 显示隐形网格

source: Start a New Connection
zh_hans: 开始新连接

source: Start Terminal Session
zh_hans: 启动终端会话

source: Success
zh_hans: 成功

source: Tab
zh_hans: 标签页

source: Tab name
zh_hans: 标签页名称

source: Terminal
zh_hans: 终端

source: Terminal Engine
zh_hans: 终端引擎

source: Terminate Session
zh_hans: 终止会话

source: The authenticity of %@ can't be established. Do you want to trust this host key and continue?
zh_hans: %@ 的真实性无法确定。您是否要信任此主机密钥并继续？

source: The remote address and SSH port (default is 22).
zh_hans: 远程地址和SSH端口（默认是22）。

source: The terminal captures your keyboard input once focused.
zh_hans: 终端在获得焦点后将接管您的所有键盘输入动作。

source: The username used to log in to the remote server.
zh_hans: 用于登录远程服务器的用户名。

source: Theme
zh_hans: 主题

source: Transferring...
zh_hans: 正在传输...

source: Transfers
zh_hans: 传输

source: Trust and Continue
zh_hans: 信任并继续

source: Typography
zh_hans: 排版字体

source: Unknown Host Key
zh_hans: 未知的主机密钥签名

source: Upload
zh_hans: 上传

source: Uptime
zh_hans: 运行时间

source: Use Public Key
zh_hans: 公钥密钥认证

source: User
zh_hans: 用户

source: User Account
zh_hans: 登录账户名

# Version %@ (%@)
source: Version %1$@ (%2$@)
zh_hans: 当前版本 %1$@ (建构 %2$@)

source: VT (SSH)
zh_hans: 远程终端 (SSH)

source: WARNING: The host key for %@ has changed. This could indicate a security issue. Only continue if you trust the new key.
zh_hans: 警告：%@主机密钥已更改。这可能表示存在安全问题。仅在您信任新密钥时继续。

source: Copy
zh_hans: 复制

source: Paste
zh_hans: 粘贴

source: Search with Google
zh_hans: 使用Google搜索

source: Split Right
zh_hans: 向右分屏

source: Split Left
zh_hans: 向左分屏

source: Split Down
zh_hans: 向下分屏

source: Split Up
zh_hans: 向上分屏

source: Reset Terminal
zh_hans: 重置终端

source: Toggle Terminal Inspector
zh_hans: 切换终端检查器

source: Terminal Read-only
zh_hans: 终端只读

source: Change Tab Title...
zh_hans: 修改标签标题...

source: Change Terminal Title...
zh_hans: 修改终端标题...

source: AutoFill
zh_hans: 自动填充

source: Fill Username
zh_hans: 填充用户名

source: Fill Password
zh_hans: 填充密码

source: Services
zh_hans: 服务

source: Change Tab Title
zh_hans: 修改标签标题

source: Enter new title for this tab:
zh_hans: 输入此标签页的新标题：

source: Copy IP
zh_hans: 复制 IP

source: Copy Password
zh_hans: 复制密码

source: Configure cloud synchronization for all your connection configurations.
zh_hans: 为您的所有连接配置设置云端同步。

source: Cloud Sync
zh_hans: 云端同步

source: GitHub Gist Sync
zh_hans: GitHub Gist 同步

source: Personal Access Token
zh_hans: 个人访问令牌 (Token)

source: Gist ID (Optional)
zh_hans: Gist ID (可选)

source: Upload to Gist
zh_hans: 上传到 Gist

source: Download & Merge
zh_hans: 下载并合并

source: Access Token
zh_hans: 访问令牌 (Token)

source: Upload to Dropbox
zh_hans: 上传到 Dropbox

source: Sync Status
zh_hans: 同步状态

source: Syncing...
zh_hans: 同步中...

source: Successfully uploaded to Gist.
zh_hans: 成功上传至 Gist。

source: Successfully downloaded and merged from Gist.
zh_hans: 成功自 Gist 下载并合并。

source: Successfully uploaded to Dropbox.
zh_hans: 成功上传至 Dropbox。

source: Successfully downloaded and merged from Dropbox.
zh_hans: 成功自 Dropbox 下载并合并。

source: Gist sync failed:
zh_hans: Gist 同步失败：

source: Dropbox sync failed:
zh_hans: Dropbox 同步失败：

source: Sync
zh_hans: 同步

source: Connection Failed
zh_hans: 连接失败

source: Encrypt Sync Data
zh_hans: 加密同步配置

source: Sync Master Password
zh_hans: 同步主密码

source: Security
zh_hans: 安全

source: Data is encrypted. Please provide your master password.
zh_hans: 数据已加密。请提供您的同步主密码。

source: Failed to convert decrypted text to data
zh_hans: 转换解密文本为 Data 失败。

source: Encryption failed
zh_hans: 加密失败。

source: Not encrypted or invalid prefix
zh_hans: 非加密数据或前缀无效。

source: Invalid base64 payload
zh_hans: 无效的 Base64 负载。

source: Invalid utf8 decrypted data
zh_hans: 无效的 UTF-8 解密数据。
